app/Controllers/Article.php

SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
AND `id_users` = '23'
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
AND `id_users` = '23'
SELECT *
FROM `categories`
SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
AND `id_users` = '13'
 LIMIT 4
SELECT *
FROM `users`
WHERE `users`.`id_users` = '23'
SELECT COUNT(*) AS `numrows`
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
AND `id_users` = '13'
---
    public function index()
    {
        $article = new ArticlesModel();
        $category = new CategoriesModel();
        $data = [
            'categories' => $category->findAll(),
            'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->where(['status' => 1, 'id_users' => session()->get('id_users')]),
            'articles' => $article->paginate(4, 'articles'),
            'pager' => $article->pager
        ];

SELECT *
FROM `categories`
---
    public function add()
    {
        $category = new CategoriesModel();
        $data = [
            'categories' => $category->findAll(),
        ];

SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 2
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 2
SELECT *
FROM `categories`
---
    public function verificationView()
    {
        $article = new ArticlesModel();
        $category = new CategoriesModel();
        $data = [
            'categories' => $category->findAll(),
            'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->where('status', 2),
            'articles' => $article->paginate(4, 'articles'),
            'pager' => $article->pager
        ];

SELECT *
FROM `articles`
JOIN `users` ON `users`.`id_users` = `articles`.`id_users`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `slug` = 'artikel-user-albanna'
 LIMIT 1
SELECT *
FROM `categories`
SELECT *
FROM `articles`
 LIMIT 3
---
    public function review($slug)
    {
        $article = new ArticlesModel();
        $category = new CategoriesModel();
        $data = [
            'categories' => $category->findAll(),
            'article' =>  $article->join('users', 'users.id_users = articles.id_users')->join('categories', 'categories.id_categories = articles.id_categories')->where('slug', $slug)->first(),
            'articles' => $article->limit(3)->find(),