app/Controllers/Community.php

SELECT *
FROM `community`
---
    public function index()
    {
        $community = new CommunityModel();
        $data = [
            'community' => $community->findAll(),
        ];

SELECT *
FROM `community`
---
    public function add()
    {
        $community = new CommunityModel();
        $data = [
            'community' => $community->findAll(),
        ];