app/Controllers/Home.php

SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
ORDER BY `date` DESC
 LIMIT 3
---
    public function index()
    {
        $visitor = new VisitorsModel();
        $visitor->save([
            'type' => 2,
            'id_articles' => 1
        ]);

        $article = new ArticlesModel();
        $data = [
            'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->limit(3)->where('status', 1)->orderBy('date', 'desc')->find(),
        ];