app/Controllers/Home.php

INSERT INTO `visitors` (`type`, `id_articles`) VALUES (2, 1)
SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
ORDER BY `date` DESC
 LIMIT 3
---
    public function index()
    {
        $visitor = new VisitorsModel();
        $visitor->save([
            'type' => 2,
            'id_articles' => 1
        ]);

        $article = new ArticlesModel();
        $data = [
            'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->limit(3)->orderBy('date', 'desc')->find(),
        ];

SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
ORDER BY `date` DESC
---
    public function article()
    {
        $article = new ArticlesModel();
        $category = new CategoriesModel();
        $data = [
            'categories' => $category->findAll(),
            'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->orderBy('date', 'desc')->findAll(),

SELECT *
FROM `articles`
JOIN `users` ON `users`.`id_users` = `articles`.`id_users`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `slug` = 'musyawarah-besar-ukm-albana'
 LIMIT 1
SELECT *
FROM `categories`
SELECT *
FROM `articles`
 LIMIT 3
INSERT INTO `visitors` (`type`, `id_articles`) VALUES (2, ('13'))
SELECT `id_articles`
FROM `articles`
WHERE `slug` = 'musyawarah-besar-ukm-albana'
 LIMIT 1
---
    public function detail($slug)
    {
        $article = new ArticlesModel();
        $category = new CategoriesModel();
        $data = [
            'categories' => $category->findAll(),
            'article' =>  $article->join('users', 'users.id_users = articles.id_users')->join('categories', 'categories.id_categories = articles.id_categories')->where('slug', $slug)->first(),
            'articles' => $article->limit(3)->find(),
        ];

        $visitor = new VisitorsModel();
        $visitor->save([
            'type' => 2,
            'id_articles' => $article->select('id_articles')->where('slug', $slug)->first()
        ]);

SELECT *
FROM `community`
---
    public function community()
    {

        $community = new CommunityModel();
        $data = [
            'community' => $community->findAll(),
        ];