app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {

        $user       = new UsersModel();
        $data = [
            // 'users'  => $user->findAll(),
            'users' => $user->paginate(4, 'users'),